OpenFOAM-v2506/modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsQMOM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
3000
(
(0.000125345480938 0.000544538443489 0)
(0.000309894894602 0.000886674640894 0)
(0.000321520559391 0.00101848381612 -4.11508905731e-30)
(0.000287269126588 0.00106195710772 -2.40349994971e-30)
(0.000240552652122 0.00106608646334 0)
(0.000197429648351 0.00105395751241 0)
(0.000158497957955 0.00103529941904 0)
(0.000126595197658 0.00101923825051 0)
...
)
;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform ( 0 0.001 0 );
    }
    inlet2
    {
        type            fixedValue;
        value           uniform ( 0 0.001 0 );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           nonuniform List<vector> 
30
(
(-5.31567275411e-14 0.000100866923106 -5.33390607757e-29)
(-3.94471497473e-13 0.000285761555693 -7.58158733172e-29)
(-5.00569565932e-13 0.000457964648889 0)
(-4.64186395128e-13 0.000617294637381 -7.61211909784e-29)
(-1.7349709809e-13 0.000763618058124 -7.60756392444e-29)
(-9.25495223085e-14 0.000896835395726 0)
(-5.10921198665e-13 0.00101687155082 0)
(-4.42648625593e-13 0.00112366936528 0)
...
)
;
    }
    walls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
